backend/controllers/TblLapanganDetailController.php

    public function actionCreate($id)
    {
        $model = new TblLapanganDetail();

        $model->id_lapangan = $id;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `tbl_lapangan_detail` (`id_lapangan`, `nama_detail`, `status`) VALUES (1, 'LAPANGAN 1', 'free')