backend/controllers/TblLapanganController.php

    protected function findModel($id)
    {
        if (($model = TblLapangan::findOne($id)) !== null) {
---
SELECT * FROM `tbl_lapangan` WHERE `id`='1'